In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
filename = '/content/drive/MyDrive/PTDataScience/PandasForDataManipulation/titanic.csv'
tan_df = pd.read_csv(filename)
tan_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

1. Display the head of the dataframe.

In [ ]:
tan_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

2. What is the percentage of people who survived? (hint find the mean of the survival column).

In [ ]:
tan_df_mean = tan_df['Survived'].mean()
print(tan_df_mean)

0.3838383838383838

So 38% Survived

#

3. How many of each sex survived?

In [ ]:
survivedFilter = tan_df.loc[:, 'Survived'] == 1

In [ ]:
tan_df.loc[survivedFilter, :].head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [ ]:
tan_df.loc[survivedFilter, 'Sex'].value_counts(dropna = False)

female    233
male      109
Name: Sex, dtype: int64

4. What is the percentage of people that survived who paid a fare less than 10

In [ ]:
fareFilter = tan_df.loc[:, 'Fare'] < 1

In [ ]:
tan_df.loc[survivedFilter & fareFilter].head()

     PassengerId  Survived  Pclass  ... Fare Cabin  Embarked
271          272         1       3  ...  0.0   NaN         S

[1 rows x 12 columns]

In [ ]:
len(tan_df.loc[survivedFilter & fareFilter, :]) / len(tan_df.loc[survivedFilter, :])

0.0029239766081871343

5. What is the average age of those who didn't survive

In [ ]:
tan_df.loc[~survivedFilter, 'Age'].mean()

30.62617924528302

6. What is the average age of those who did survive?

In [ ]:
tan_df.loc[survivedFilter, 'Age'].mean()

28.343689655172415

7. What is the average age of those who did and didn't survive grouped by Sex

In [ ]:
tan_df.groupby(['Sex'])[['Age']].mean()

              Age
Sex
female  27.915709
male    30.726645